# Pandas Series

In [7]:
import numpy as np
import pandas as pd

In [21]:
labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [22]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [23]:
pd.Series(data = my_data,index = labels)

a    10
b    20
c    30
dtype: int64

In [24]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [25]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [26]:
pd.Series(data = [sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [27]:
ser1 = pd.Series([1,2,3,4],['France','Germany','Japan','Brazil'])

In [28]:
ser1

France     1
Germany    2
Japan      3
Brazil     4
dtype: int64

In [29]:
ser1['Brazil']

4

In [31]:
ser2 = pd.Series(data = labels)
ser2

0    a
1    b
2    c
dtype: object

In [32]:
ser2[0]

'a'

In [33]:
ser3 = pd.Series([1,2,3,4],['Peru','Norway','Japan','Brazil'])

In [34]:
ser1 + ser3

Brazil     8.0
France     NaN
Germany    NaN
Japan      6.0
Norway     NaN
Peru       NaN
dtype: float64

# DataFrames

In [35]:
from numpy.random import randn

In [36]:
np.random.seed(101)

In [37]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])

In [39]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [43]:
type(df['W'])

pandas.core.series.Series

In [44]:
type(df)

pandas.core.frame.DataFrame

In [49]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [53]:
#df['new'] would output an error

#insert new column
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [54]:
df.drop('new', axis = 1, inplace = True)
#inplace = True to remove it definitely
#remove column

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
#drop rows
df.drop('E', axis = 0)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [56]:
df.shape

(5, 5)

In [57]:
df[['Z']]

          Z
A  0.503826
B  0.605965
C -0.589001
D  0.955057
E  0.683509

In [ ]:
df.loc['A']

In [58]:
#selecting a row by its name

df.loc['C']

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -1.489355
Name: C, dtype: float64

In [60]:
#selecting a row by its index

df.iloc[2]

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -1.489355
Name: C, dtype: float64

In [61]:
#row x column

df.loc['B','Y']

-0.8480769834036315

In [63]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077